sangko-dgq/MCUTemplates/Template_STC/Template_ STC32G12K128/STC32G_dev_space/Example projects/STC32G-DEMO/DEMO/6-数码管动态显示/Project.c
/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#include "../../comm/STC32G.h"  //包含此头文件后，不需要再包含"reg51.h"头文件

#define     MAIN_Fosc       24000000L   //定义主时钟
sbit DU=P2^6;//定义段选
sbit WE=P2^7;//定义位选

/*************  功能说明    **************

本例程基于STC32G转STC89系列转接板（降龙棍）进行编写测试。

程序使用IO口来演示跑马灯，输出低驱动。

下载时, 选择时钟 24MHZ (用户可自行修改频率)。

当用户使用硬件 USB 对 STC32G 系列进行 ISP 下载时不能调节内部 IRC 的频率，
但用户可用选择内部预置的 16 个频率
（分别是 5.5296M、 6M、 11.0592M、 12M、 18.432M、 20M、 22.1184M、 
24M、27M、 30M、 33.1776M、 35M）。
下载时用户只能从频率下拉列表中进行选择其中之一，而不能手动输入其他频率。
（使用串口下载则可用输入 4M～35M 之间的任意频率）。

******************************************/

typedef     unsigned char   u8;
typedef     unsigned int    u16;
typedef     unsigned long   u32;

void  delay_ms(u8 ms);
unsigned char NixieTable[]={0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F};

/******************** 主函数 **************************/
void main(void)
{
    WTST = 0;  //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
    EAXFR = 1; //扩展寄存器(XFR)访问使能
    CKCON = 0; //提高访问XRAM速度

    P0M1 = 0x00;   P0M0 = 0x00;   //设置为准双向口
    P1M1 = 0x00;   P1M0 = 0x00;   //设置为准双向口
    P2M1 = 0x00;   P2M0 = 0x00;   //设置为准双向口
    P3M1 = 0x00;   P3M0 = 0x00;   //设置为准双向口
    P4M1 = 0x00;   P4M0 = 0x00;   //设置为准双向口
    P5M1 = 0x00;   P5M0 = 0x00;   //设置为准双向口
    P6M1 = 0x00;   P6M0 = 0x00;   //设置为准双向口
    P7M1 = 0x00;   P7M0 = 0x00;   //设置为准双向口

    while(1)
    {
		P0=NixieTable[8];	//数字8
		DU=1;
		DU=0;
		P0=0x7f;
		WE=1;
		WE=0;
		delay_ms(2);		//延迟小于3ms人眼则看到8位数码管同时点亮

		P0=NixieTable[7];	//数字7
		DU=1;
		DU=0;
		P0=0xbf;
		WE=1;
		WE=0;
		delay_ms(2);

		P0=NixieTable[6];	//数字6
		DU=1;
		DU=0;
		P0=0xdf;
		WE=1;
		WE=0;
		delay_ms(2);

		P0=NixieTable[5];	//数字5
		DU=1;
		DU=0;
		P0=0xef;
		WE=1;
		WE=0;
		delay_ms(2);

		P0=NixieTable[4];	//数字4
		DU=1;
		DU=0;
		P0=0xf7;
		WE=1;
		WE=0;
		delay_ms(2);

		P0=NixieTable[3];	//数字3
		DU=1;
		DU=0;
		P0=0xfb;
		WE=1;
		WE=0;
		delay_ms(2);

		P0=NixieTable[2];	//数字2
		DU=1;
		DU=0;
		P0=0xfd;
		WE=1;
		WE=0;
		delay_ms(2);

		P0=NixieTable[1];	//数字1
		DU=1;
		DU=0;
		P0=0xfe;
		WE=1;
		WE=0;
		delay_ms(2);
    }
}

//========================================================================
// 函数: void delay_ms(u8 ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 这里只支持1~255ms. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2022-6-3
// 备注: 
//========================================================================
void delay_ms(u8 ms)
{
     u16 i;
     do{
          i = MAIN_Fosc / 6000;
          while(--i);   //6T per loop
     }while(--ms);
}

